Revit 2027 API
IExternalEventHandler Interface
 An interface to be executed when an external event is raised.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExternalEventHandler
Public Interface IExternalEventHandler
public interface class IExternalEventHandler
type IExternalEventHandler = interface end
The IExternalEventHandler type exposes the following members.
Methods
Name | Description
Execute |  This method is called to handle the external event.
GetName |  String identification of the event handler.
Top
Remarks
 An instance of a class implementing this interface will be registered with Revit first, and every time the corresponding external event is raised, the Execute method of this interface will be invoked.
See Also
Reference
Autodesk.Revit.UI Namespace